Repository: Vobinics/URM-EUCTI-Bot
Catalog: app/app/locales/*/LC_MESSAGES/bot.po
Languages: ru

source: Hello! With this bot, you can subscribe to the **EUC Testing Initiative for UniRoadMap** to help us create a really polished and _good_ product! Your data will be used to create **unique** settings for **each** EUC model for our navigation engine. Every personal information about you is stored _securely_ and **no one** except our developers can access it.
ru: Здравствуйте! С помощью этого бота вы можете подписаться на **EUC Testing Initiative for UniRoadMap**, чтобы помочь нам создать действительно отточенный и _хороший_ продукт! Ваши данные будут использоваться для создания **уникальных** настроек для **каждой** модели EUC для нашей системы навигации. Вся личная информация о вас хранится _надежно_, и **никто**, кроме наших разработчиков, не может получить к ней доступ.

source: This bot is designed to collect unicycle trip logs. These logs will help you create optimized configurations for each electric unicycle To start, follow the instructions after calling the command /start
ru: Этот бот предназначен для сбора логов поездок на моноколесе. Эти логи помогут создать оптимизированные конфигурации для кажого моноколеса Для того чтобы начать, следуйте инструкциям после вызова комманды /start

source: Quests coming soon! Follow the news on our channel {channel}
ru: Задания скоро будут! Следи за новостями на нашем канале {channel}

source: *Allow tasks*
ru: *Доступные задания*

source: Task with this id does not exist
ru: Задачи с таким id не существует

source: Done
ru: Готово

source: In work
ru: В работе

source: Not performed
ru: Не выполнено

source: *Difficulty: {task_title}* Status: {status} *Task description* Drive along {road_type} with slides and slopes at an angle of no more than {permissible_angle} degrees. Start should be with a full battery charge, and stop at {charge_percentage} percentage of the battery. Speed should be within {need_speed} km/h. The trip should be recorded to a file using the WheelLog program. If you have an iOS device, use the EUCWorld application. In the report, along with the file, write which unicycle you drove
ru: *Сложность: {task_title}* Статус: {status} *Текст задания* Проехать по {road_type} с горками и спусками углом не более {permissible_angle} градусов. Старт должен быть с полным зарядом батареи, а стоп на {charge_percentage} процентах батареи. Скорость должна быть в границах {need_speed} км/ч. Поездка должна записываться в файл при помощи программы WheelLog. Если у Вас устройство iOS, используйте приложение EUCWorld. В отчете вместе с файлом напишите, на каком моноколесе вы ехали.

source: Task refused
ru: Задача отклонена

source: This task has already been completed
ru: Это задание уже выполнено

source: After completing this task, send the recorded logs to the bot in csv format and a signature to the file with the model of your electric unicycle
ru: После выполнения этого задания отправьте записанные логи боту в формате csv и подписью к файлу с моделью вашего моноколеса

source: Invalid file format! Need a file in csv format
ru: Неверный формат файла! Нужен файл в формате csv

source: The submitted file has no signature with the electric unicycle model
ru: Отправленный файл не имеет подписи с моделью моноколеса

source: Thanks for your input!
ru: Спасибо за ваш вклад!

source: *Difficulty: {task_title}* User: [{user_name}](tg://user?id={user_id}) Normal speed: {normal_speed} Normal distance: {normal_distance} Place residence: {place_residence} Message: {caption}
ru: *Сложность: {task_title}* Пользователь: [{user_name}](tg://user?id={user_id}) Стандартная скорость: {normal_speed} Стандартная дистанция: {normal_distance} Место проживания: {place_residence} Сообщение: {caption}

source: The request was not recognized. For instructions on how to use the bot, call the /help command
ru: Запрос не распознан. Для получения инструкций по использованию бота вызовите комманду /help

source: Example road
ru: Пример дороги

source: Refuse to execute
ru: Отказаться от исполнения

source: Proceed with!
ru: Приступить к выполнению!

source: Register
ru: Зарегистрироваться

source: The maximum allowed length for this value is {max_length} characters
ru: Максимальная допустимая длина для этого значения является {max_length} символов

source: The entered value is not an integer
ru: Введенное значение не является целым числом

source: Where do you live? Please write your country and city names, e.g. New York, US
ru: Где вы живете? Пожалуйста, напишите название вашей страны и города. Например: Киев, Украина

source: How many kilometers do you travel on a unicycle per day?
ru: Сколько вы проезжаете километров на моноколесе за день?

source: What is your average speed on a unicycle?
ru: Какая ваша средняя скорость поездки на моноколесе?

source: Registration passed!
ru: Регистрация завершена!

source: Difficulty:
ru: Сложность:
